DanNixon/ArduinoTiLDAHardware/hardware/sam/boards.txt
tilda_mk2.name=TiLDA MKe v0.2 (Arduino Core)
tilda_mk2.vid.0=0x2341
tilda_mk2.pid.0=0x003e
tilda_mk2.upload.tool=arduino:bossac
tilda_mk2.upload.protocol=sam-ba
tilda_mk2.upload.maximum_size=524288
tilda_mk2.upload.use_1200bps_touch=true
tilda_mk2.upload.wait_for_upload_port=true
tilda_mk2.upload.native_usb=true
tilda_mk2.build.mcu=cortex-m3
tilda_mk2.build.f_cpu=84000000L
tilda_mk2.build.usb_product="Arduino Due"
tilda_mk2.build.board=SAM_DUE
tilda_mk2.build.core=arduino:arduino
tilda_mk2.build.extra_flags=-D__SAM3X8E__ -mthumb {build.usb_flags}
tilda_mk2.build.ldscript=linker_scripts/gcc/flash.ld
tilda_mk2.build.variant=tilda_mk2
tilda_mk2.build.variant_system_lib=libsam_sam3x8e_gcc_rel.a
tilda_mk2.build.vid=0x2341
tilda_mk2.build.pid=0x003e

tilda_mke.name=TiLDA MKe v0.333 (Arduino Core)
tilda_mke.vid.0=0x2341
tilda_mke.pid.0=0x003e
tilda_mke.upload.tool=arduino:bossac
tilda_mke.upload.protocol=sam-ba
tilda_mke.upload.maximum_size=524288
tilda_mke.upload.use_1200bps_touch=true
tilda_mke.upload.wait_for_upload_port=true
tilda_mke.upload.native_usb=true
tilda_mke.build.mcu=cortex-m3
tilda_mke.build.f_cpu=84000000L
tilda_mke.build.usb_product="Arduino Due"
tilda_mke.build.board=SAM_DUE
tilda_mke.build.core=arduino:arduino
tilda_mke.build.extra_flags=-D__SAM3X8E__ -mthumb {build.usb_flags}
tilda_mke.build.ldscript=linker_scripts/gcc/flash.ld
tilda_mke.build.variant=tilda_mke_v0.333
tilda_mke.build.variant_system_lib=libsam_sam3x8e_gcc_rel.a
tilda_mke.build.vid=0x2341
tilda_mke.build.pid=0x003e